package de.telran.yuriiarzumanov.hw171122;

//Напишите программу, которая выводит на экран значение переменной типа инт в квадрате (n* n).
//Предварительно объявите эту переменную и задайте ее значение. Например для числа 5 нужно распечатать 25

public class Squared {
    public static void main(String[] args) {
        int num = 5 ;
        int res = ( num * num);
    System.out.println(res);
    }
}
