package de.telran.yuriiarzumanov.hw221222;

//Найти в массиве самую длинную последовательность, состоящую из одинаковых элементов.
// Вывести на экран количество элементов
// самой длиной последовательности и номер элемента, который является ее началом.
//Например, если массив выглядит так: 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0 ,
// то количество элементов самой длинной последовательности, состоящей из одинаковых элементов,
// равно 5, а начинается она с 9-го элемента.
public class Task3level1 {
    public static void main(String[] args) {

    }
}

